In [11]:
from pandas import DataFrame
df = DataFrame(
                    [
                        ['aryan','singh','full-time','administration',2,20000],
                        ['rohan','agarwal','intern','technical',3,5000],
                        ['riya','shah','full-time','administration',5,10000],
                        ['yash','bhatia','part-time','technical',7,10000],
                        ['sidhant','khanna','full-time','management',6,20000],
                        
                    ],columns=['Frist Name','Last Name','Type','Department','yoE','Salary']
             )
df

  Frist Name Last Name       Type      Department  yoE  Salary
0      aryan     singh  full-time  administration    2   20000
1      rohan   agarwal     intern       technical    3    5000
2       riya      shah  full-time  administration    5   10000
3       yash    bhatia  part-time       technical    7   10000
4    sidhant    khanna  full-time      management    6   20000

make a pivot table which shows average of each type of employee for each department

In [10]:
import pandas as pd
table=pd.pivot_table(df,index='Type',columns='Department',values='Salary')
table

Department  administration  management  technical
Type
full-time          15000.0     20000.0        NaN
intern                 NaN         NaN     5000.0
part-time              NaN         NaN    10000.0

make a pivot table which shows the sum and mean of the salaries of each type of employee and the number of employees of each type

In [15]:
import pandas as pd
table=pd.pivot_table(df,index='Type',values='Salary',aggfunc=['sum','mean','count'])
table

             sum          mean  count
          Salary        Salary Salary
Type
full-time  50000  16666.666667      3
intern      5000   5000.000000      1
part-time  10000  10000.000000      1